tap "caskroom/fonts"
tap "codekitchen/dinghy"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "puma/puma"
tap "wtfutil/wtfutil"

brew "automake"
brew "bison"
brew "chruby"
brew "coreutils"
brew "docker"
brew "gdbm"
brew "libyaml"
brew "readline"
brew "docker-compose"
brew "docker-machine"
brew "fzf"
brew "libffi"
brew "gnupg"
brew "gron"
brew "libtool"
brew "jq"
brew "libxmlsec1"
brew "mas"
brew "neofetch"
brew "nvm"
brew "openssl"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "postgresql@9.5"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "the_silver_searcher"
brew "trash"
brew "vaulted"
brew "vim"
brew "yarn"
brew "zlib"
brew "zsh"
brew "dinghy"
brew "lazydocker"
brew "puma-dev"
brew "wtfutil"

cask "alfred"
cask "amazon-music"
cask "boom-3d"
cask "dashlane"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-chrome-canary"
cask "hyperdock"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "microsoft-edge-beta"
cask "microsoft-edge-dev"
cask "microsoft-teams"
cask "paw"
cask "slack"
cask "sourcetree"
cask "virtualbox"
cask "visual-studio-code-insiders"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "mactex"

mas "Airmail", id: 918858936
mas "com.linebreak.CloudAppMacOSX", id: 417602904
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "GarageBand", id: 682658836
mas "Pixelmator", id: 407963104
mas "Wunderlist", id: 410628904
