# require_relative ./comm

# Tap into some additional things
tap 'codekitchen/dinghy'
tap 'puma/puma'
tap 'jesseduffield/lazydocker'
tap 'wtfutil/wtfutil'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

# Make sure java is around
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Help make configuring stuff easier
brew 'automake'


# Utilities to make finding stuff easier
brew 'the_silver_searcher'
brew 'fzf'
brew 'ripgrep'
brew 'gron'

# Crypto stuff
brew 'gpg'

# Node stuff
brew 'nvm'


# Manage credentials
brew 'vaulted'
# cask 'dashlane' # No longer available


# Editors
brew 'vim'
cask 'visual-studio-code-insiders'
cask 'intellij-idea-ce'

# Google Utilities
cask 'google-cloud-sdk'


# Install Mac App Store stuff easier
brew 'mas'

brew 'gh' # Github CLI


#############################
#### Mac Apps to Install ####
#############################

# Communication
cask 'keybase'
cask 'slack'
# cask 'microsoft-teams' Don't really use this anymore
cask 'messenger'
mas "Limechat", id: 414030210

# Browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'microsoft-edge-beta'
cask 'microsoft-edge-dev'

# Storage Services
cask 'dropbox'

# VMs
# cask 'virtualbox'

# Terminals
cask 'iterm2'

# Window Management / Dock Enhancments
# cask 'hyperdock' # Not really maintained anymore
# cask 'divvy'     # Useful for large monitors, but honestly, rectangle is working well
cask 'rectangle'

# Note Taking
# cask 'evernote' #Fully using notion now
cask 'notion'
# mas "Day One", id: 1055511498 # Not using this anymore

# Fonts
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# Searching and Workflow
cask 'alfred'

# Keyboard Manipulation
# cask 'karabiner-elements' # Not really doing this anymore

# Music
cask 'amazon-music'
cask 'boom-3d'

# API Development
cask 'paw'

# Office
cask 'microsoft-office'

#############################
###### App Store Apps #######
#############################

# Email client
# Removed in favor of regular Apple Mail until they can figure out how not to be annoying
# mas "Airmail", id: 918858936

# Screencasting
mas "com.linebreak.CloudAppMacOSX", id: 417602904

# Disk Space Management
mas "DaisyDisk", id: 411643860

# Photo Manipulation
mas "Pixelmator", id: 407963104

mas "Dashlane", id:517914548
