cask_args appdir: '/Applications'

cask 'java' unless system '/usr/libexec/java_home --failfast'

brew 'automake'
brew 'codekitchen/dinghy/dinghy'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'fzf'
brew 'ripgrep'
brew 'gpg'
brew 'nvm'
brew 'puma/puma/puma-dev'
brew 'the_silver_searcher'
brew 'vaulted'
brew 'vim'
brew 'mas'
brew 'rsync'
brew 'zsh'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'wtfutil/wtfutil/wtfutil'

cask 'dashlane'
cask 'dropbox'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'google-chrome'
cask 'homebrew/cask-versions/google-chrome-canary'
cask 'homebrew/cask-versions/microsoft-edge-beta'
cask 'homebrew/cask-versions/microsoft-edge-dev'
cask 'virtualbox'
cask 'iterm2'
cask 'sourcetree'
cask 'slack'
cask 'microsoft-teams'
cask 'hyperdock'
cask 'dashlane'
cask 'evernote'
cask 'caskroom/fonts/font-source-code-pro'
cask 'alfred'
cask 'homebrew/cask-versions/visual-studio-code-insiders'
cask 'karabiner-elements'
cask 'amazon-music'
cask 'boom-3d'
