cask_args appdir: '/Applications'

cask 'java' unless system '/usr/libexec/java_home --failfast'

brew 'automake'
brew 'chruby'
brew 'ruby-install'
brew 'codekitchen/dinghy/dinghy'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'fzf'
brew 'ripgrep'
brew 'gpg'
brew 'nvm'
brew 'puma/puma/puma-dev'
brew 'the_silver_searcher'
brew 'vaulted'
brew 'vim'
brew 'mas'
brew 'rsync'
brew 'zsh'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'wtfutil/wtfutil/wtfutil'
brew 'gron'
brew 'jq'
brew 'trash'
brew 'neofetch'
brew 'postgresql'
brew 'git-lfs'

cask 'keybase'
cask 'dashlane'
cask 'dropbox'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'google-chrome'
cask 'homebrew/cask-versions/google-chrome-canary'
cask 'homebrew/cask-versions/microsoft-edge-beta'
cask 'homebrew/cask-versions/microsoft-edge-dev'
cask 'virtualbox'
cask 'iterm2'
cask 'sourcetree'
cask 'slack'
cask 'microsoft-teams'
cask 'hyperdock'
cask 'dashlane'
cask 'evernote'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-hack-nerd-font'
cask 'alfred'
cask 'homebrew/cask-versions/visual-studio-code-insiders'
cask 'karabiner-elements'
cask 'amazon-music'
cask 'boom-3d'
cask 'paw'
cask 'postico'
cask 'steam'
cask 'microsoft-office'
cask 'intellij-idea-ce'
cask 'divvy'

mas "Airmail", id: 918858936
mas "com.linebreak.CloudAppMacOSX", id: 417602904
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "GarageBand", id: 682658836
mas "Pixelmator", id: 407963104
mas "Wunderlist", id: 410628904
mas "Limechat", id: 414030210
